{
  "contacto": [
    {
      "tipo": "facebook",
      "url": "https://www.facebook.com/ManuelD.Jesus8/",
      "icon": "fab fa-facebook",
      "texto": null
    },
    {
      "tipo": "linkedin",
      "url": "https://www.linkedin.com/in/manuel-henriquez-a8541423a/",
      "icon": "fab fa-linkedin",
      "texto": null
    },
    {
      "tipo": "github",
      "url": "https://github.com/MHenriquezD",
      "icon": "fab fa-github-square",
      "texto": null
    },
    {
      "tipo": "email",
      "url": "mailto:mdhenriquez16@gmail.com",
      "icon": "fas fa-envelope",
      "texto": "mdhenriquez16@gmail.com"
    },
    {
      "tipo": "telefono",
      "url": "https://wa.me/50492370288?text=Hola%20Manuel,%20vi%20tu%20portafolio%20y%20me%20gustar%C3%ADa%20contactarte.",
      "icon": "fas fa-phone",
      "texto": "+504 9237-0288"
    }
  ],
  "habilidades": [
    {
      "id": 1,
      "titulo": "HTML",
      "img": "/img/html.svg"
    },
    {
      "id": 2,
      "titulo": "CSS",
      "img": "/img/css.svg"
    },
    {
      "id": 3,
      "titulo": "JavaScript",
      "img": "/img/javascript.svg"
    },
    {
      "id": 4,
      "titulo": "JQuery",
      "img": "/img/jquery.svg"
    },
    {
      "id": 5,
      "titulo": "NodeJS",
      "img": "/img/node.svg"
    },
    {
      "id": 6,
      "titulo": "typescript",
      "img": "/img/typescript.svg"
    },
    {
      "id": 7,
      "titulo": "Express",
      "img": "/img/express.svg"
    },
    {
      "id": 8,
      "titulo": "PHP",
      "img": "/img/php.svg"
    },
    {
      "id": 9,
      "titulo": "PostgreSQL",
      "img": "/img/postgresql.svg"
    },
    {
      "id": 10,
      "titulo": "MySQL",
      "img": "/img/mysql.svg"
    },
    {
      "id": 11,
      "titulo": "SQLite",
      "img": "/img/sqlite.svg"
    },
    {
      "id": 12,
      "titulo": "MongoDB",
      "img": "/img/mongo.svg"
    },
    {
      "id": 13,
      "titulo": "VueJS",
      "img": "/img/vuelogo.svg"
    },
    {
      "id": 14,
      "titulo": "NestJS",
      "img": "img/nestjslogo.svg"
    }
  ],
  "experiencia": [
    {
      "id": 1,
      "titulo": "Desarrollador Back-End",
      "periodo": "Enero 2025 - Actualidad",
      "descripcion": "Desarrollador Back-End en la empresa SERVICIO NACIONAL DE EMPRENDIMIENTO Y DE PEQUEÑOS NEGOCIOS (<b>SENPRENDE</b>). <br>NestJS, TypeScript, PostgreSQL, MongoDB, Prisma, VueJS"
    },
    {
      "id": 2,
      "titulo": "Consultoría Tecnológica",
      "periodo": "Jul 2024 - Dic 2024",
      "descripcion": "Consultoría Tecnológica en CDE Mipyme Coordillera Nombre de Dios. <br> Análisis de sistemas, desarrollo de software, soporte técnico y capacitación."
    },
    {
      "id": 3,
      "titulo": "Desarrollador Back-End",
      "periodo": "Nov 2023 - Jun 2024",
      "descripcion": "Desarrollador Back-End en la empresa SERVICIO NACIONAL DE EMPRENDIMIENTO Y DE PEQUEÑOS NEGOCIOS (<b>SENPRENDE</b>). <br> NestJS, TypeScript, PostgreSQL, MongoDB."
    },
    {
      "id": 4,
      "titulo": "Web Developer",
      "periodo": "2021 - 2022",
      "descripcion": "Desarrollador WEB en la empresa CCS Consultores (Honduras).<br>Utilizando CSS, HTML, JavaScrip y PHP."
    }
  ],
  "educacion":[
    {
      "id": 0,
      "titulo": "Ingeniería en Sistemas",
      "periodo": "2015 - Actualidad",
      "descripcion": "Pasante universitario de la carrera Ingeniería en Sistemas en la UNAH."
    },
    {
        "id": 2,
        "titulo": "NestJS de Cero a Experto",
        "periodo": "2022 - 2022",
        "descripcion": "Curso de desarrollo back-end con NestJS, de Fernando Herrera en DevTalles."
    },
    {
      "id": 1,
      "titulo": "PCAP - Programming Essentials in Python",
      "periodo": "2021 - 2021",
      "descripcion": "Curso de desarrollo en Python, de CISCO Networking Academy."
    },
    {
      "id": 2,
      "titulo": "Introduction to Cybersecurity",
      "periodo": "2020 - 2020",
      "descripcion": "Curso de introducción a la cyber seguridad de CISCO Networking Academy."
    },
    {
      "id": 3,
      "titulo": "NDG Linux Unhatched",
      "periodo": "2020 - 2020",
      "descripcion": "Curso de introduccion LINUX de CISCO Networking Academy."
    },
    {
      "id": 4,
      "titulo": "Técnico en Computación",
      "periodo": "2011 - 2014",
      "descripcion": "Bachillerato técnico en computación."
    }
  ],
  "proyectos": [
    {
      "id": 0,
      "titulo": "POS para Restaurantes",
      "img": "https://i.postimg.cc/2SCV8xyZ/logo.jpg",
      "url": "https://github.com/ManuelDHenriquez/Restaurante",
      "descripcion": "Sistema de punto de venta (POS) integral desarrollado específicamente para la gestión de restaurantes. Implementa funcionalidades completas de gestión de mesas, pedidos en tiempo real, control de inventario, facturación electrónica y reportes de ventas. La arquitectura del sistema facilita la comunicación entre meseros, cocina y caja, optimizando el flujo de trabajo y mejorando la experiencia del cliente. Desarrollado con JavaScript, PHP y MySQL, integrando tecnologías frontend como jQuery y Bootstrap para una interfaz responsiva e intuitiva."
    },
    {
      "id": 1,
      "titulo": "ATKi Software",
      "img": "https://atki.online/images/2023/05/10/atkisoftwaremascota.png",
      "url": "https://atki.online/",
      "descripcion": "Plataforma empresarial SaaS diseñada para la administración integral de operaciones diarias en tiempo real. El sistema proporciona módulos completos de gestión financiera, control de inventario, facturación electrónica, recursos humanos y análisis de datos mediante dashboards interactivos. Orientado específicamente a micro, pequeñas y medianas empresas, combina seguridad robusta, escalabilidad y una interfaz amigable que permite a los usuarios gestionar sus negocios de manera eficiente sin requerir conocimientos técnicos avanzados."
    },
    {
      "id": 2,
      "titulo": "RapidRiders",
      "img": "https://i.postimg.cc/LsgBFZTw/rapid-riders-admins.png",
      "url": "",
      "descripcion": "Aplicación web full-stack desarrollada como proyecto universitario para la gestión de servicios de delivery. El sistema implementa una arquitectura completa con tres interfaces especializadas: panel administrativo para supervisión y reportes, aplicación de clientes para realizar pedidos, y sistema para motoristas que gestiona las entregas en tiempo real. Desarrollado desde cero con arquitectura RESTful, incluye autenticación JWT, geolocalización en tiempo real, sistema de notificaciones y gestión de estados de órdenes. Stack tecnológico: Node.js, TypeScript, Express, MongoDB para el backend, con frontend en Bootstrap y JavaScript."
    },
    {
      "id": 3,
      "titulo": "Salón Azul FFAA",
      "img": "https://i.postimg.cc/wM3C9MRP/ffaa.png",
      "url": "",
      "descripcion": "Colaboración técnica en el Salón Azul Computacional de la Fuerza Aérea Hondureña, proporcionando soporte en desarrollo de software y sistemas institucionales. El trabajo incluyó análisis de requerimientos, desarrollo de soluciones tecnológicas personalizadas, mantenimiento de sistemas críticos y capacitación técnica al personal. Experiencia en entorno gubernamental con altos estándares de seguridad y cumplimiento de protocolos institucionales."
    },
    {
      "id": 4,
      "titulo": "ComerciaHN",
      "img": "/img/comerciahn.png",
      "url": "",
      "descripcion": "Plataforma de comercio electrónico a nivel nacional desarrollada para SENPRENDE, diseñada para impulsar el emprendimiento hondureño conectando más de 900 emprendedores con consumidores locales e internacionales. El sistema incluye marketplace completo con catálogo de productos, carrito de compras, pasarelas de pago, sistema de gestión de inventario, panel administrativo avanzado con analytics, gestión de tiendas virtuales y CRM para vendedores. Arquitectura escalable construida con NestJS y TypeScript en el backend, PostgreSQL para persistencia de datos, Prisma como ORM, y Vue.js 3 con Composition API en el frontend, garantizando alto rendimiento y mantenibilidad."
    }
  ],
  "rapidRidersProyectos": [
    {
      "id": 1,
      "titulo": "RapidRiders Admins",
      "url": "https://github.com/ManuelDHenriquez/RapidRiders-Admins",
      "icon": "fa-solid fa-user-shield",
      "img": "https://i.postimg.cc/LsgBFZTw/rapid-riders-admins.png",
      "descripcion": "Front-end del proyecto RapidRiders, Este está diseñado para que los Administradores desempeñen su papel sin problema alguno."
    },
    {
      "id": 2,
      "titulo": "RapidRiders Clientes",
      "url": "https://github.com/ManuelDHenriquez/RapidRiders-Clientes",
      "icon": "fa-solid fa-users",
      "img": "https://i.postimg.cc/LsgBFZTw/rapid-riders-admins.png",
      "descripcion": "Front-end del proyecto RapidRiders, Este está diseñado para que los Clientes puedan hacer sus órdenes sin inconvenientes."
    },
    {
      "id": 3,
      "titulo": "RapidRiders Motoristas",
      "url": "https://github.com/ManuelDHenriquez/RapidRiders-Motorista",
      "icon": "fa-solid fa-motorcycle",
      "img": "https://i.postimg.cc/LsgBFZTw/rapid-riders-admins.png",
      "descripcion": "Front-end del proyecto RapidRiders, Este está diseñado para que los Motoristas puedan ver sus órdenes y entregarlas sin inconvenientes."
    },
    {
      "id": 4,
      "titulo": "RapidRiders Back-End (server)",
      "url": "https://github.com/ManuelDHenriquez/RapidRiders-Backend",
      "icon": "fa-solid fa-server",
      "img": "https://i.postimg.cc/LsgBFZTw/rapid-riders-admins.png",
      "descripcion": "Back-end del proyecto RapidRiders, en este se encuentra todo el cuerpo central de la aplicación ya que están las rutas, conexiones, esquemas, modelos, endpoints, etc. Este fue diseñado para contribuir con el funcionamiento de la aplicación y que sea lo más eficiente posible."
    }
  ],
  "ComerciaHN": [
    {
        "id": 1,
        "titulo": "ComerciaHN Clientes",
        "url": "https://comercia.hn/",
        "icon": "fa-solid fa-shopping-cart",
        "img": "/img/comerciahn.png",
        "descripcion": "Front-end del proyecto ComerciaHN, diseñado para que los clientes puedan explorar más de 300 productos de emprendedores hondureños, realizar compras y gestionar sus órdenes de manera intuitiva y segura."
    },
    {
        "id": 2,
        "titulo": "ComerciaHN Admin",
        "url": "https://admin.comercia.hn/",
        "icon": "fa-solid fa-user-shield",
        "img": "/img/comerciahn.png",
        "descripcion": "Panel administrativo del proyecto ComerciaHN, diseñado para que los emprendedores y administradores puedan gestionar tiendas, productos, órdenes, inventario y usuarios con un sistema completo de analytics y reportes."
    }
  ]
}


